In [96]:
import numpy as np
import pandas as pd

In [97]:
df3 = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [7]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796
E  0.062377  1.317548 -3.101274  1.060247

In [9]:
df3['W']

A    0.012181
B    0.670178
C   -0.513680
D   -0.999693
E    0.062377
Name: W, dtype: float64

In [10]:
type(df3['W'])

pandas.core.series.Series

In [11]:
df3[['W']]

          W
A  0.012181
B  0.670178
C -0.513680
D -0.999693
E  0.062377

In [12]:
type(df3[['W']])

pandas.core.frame.DataFrame

In [13]:
df3[['W','Z']]

          W         Z
A  0.012181 -0.609408
B  0.670178 -0.385997
C -0.513680 -1.391628
D -0.999693 -1.029796
E  0.062377  1.060247

In [14]:
df3.W

A    0.012181
B    0.670178
C   -0.513680
D   -0.999693
E    0.062377
Name: W, dtype: float64

In [17]:
df3['A':'C']

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628

In [23]:
df3['A':'C']['W']

A    0.012181
B    0.670178
C   -0.513680
Name: W, dtype: float64

In [18]:
df3['A':'A']

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408

In [19]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796
E  0.062377  1.317548 -3.101274  1.060247

In [27]:
df3["new"] = df3['W'] + df3['Y']

In [28]:
df3

          W         X         Y         Z       new
A  0.012181  0.525178 -1.609861 -0.609408 -1.597681
B  0.670178  0.377374  0.985161 -0.385997  1.655339
C -0.513680 -1.136574  1.383130 -1.391628  0.869450
D -0.999693  0.247293  1.118312 -1.029796  0.118619
E  0.062377  1.317548 -3.101274  1.060247 -3.038897

In [29]:
df3.drop('new', axis=1)

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796
E  0.062377  1.317548 -3.101274  1.060247

In [30]:
df3

          W         X         Y         Z       new
A  0.012181  0.525178 -1.609861 -0.609408 -1.597681
B  0.670178  0.377374  0.985161 -0.385997  1.655339
C -0.513680 -1.136574  1.383130 -1.391628  0.869450
D -0.999693  0.247293  1.118312 -1.029796  0.118619
E  0.062377  1.317548 -3.101274  1.060247 -3.038897

In [31]:
df3.drop('new', axis=1, inplace=True)

In [32]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796
E  0.062377  1.317548 -3.101274  1.060247

In [33]:
df3.drop('E',axis=0)

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [34]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796
E  0.062377  1.317548 -3.101274  1.060247

In [35]:
df3.drop('E',axis=0,inplace=True)

In [36]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [37]:
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4

   var1  var2  var3
0    27    10    18
1    28    16    10
2    15     3     2
3     4    13    27
4    29     1    13
5    12    18    16
6    21     4    24
7     1    10    28
8    27    19    25
9     1     4    19

In [38]:
df4.loc[1]

var1    28
var2    16
var3    10
Name: 1, dtype: int32

In [40]:
df4.loc[1:4] # In this point last value is also showing

   var1  var2  var3
1    28    16    10
2    15     3     2
3     4    13    27
4    29     1    13

In [42]:
df4.iloc[1:4] # # In this point last value is not showing. Because iloc works as index

   var1  var2  var3
1    28    16    10
2    15     3     2
3     4    13    27

In [43]:
df4.index = "a b c d e f g h i j".split()

In [44]:
df4

   var1  var2  var3
a    27    10    18
b    28    16    10
c    15     3     2
d     4    13    27
e    29     1    13
f    12    18    16
g    21     4    24
h     1    10    28
i    27    19    25
j     1     4    19

In [45]:
df4.iloc[1:4]

   var1  var2  var3
b    28    16    10
c    15     3     2
d     4    13    27

In [49]:
df4.loc['b':'d'] # df4.loc[1:d] does not work. Because loc works as label

   var1  var2  var3
b    28    16    10
c    15     3     2
d     4    13    27

In [50]:
df4.loc['b','var2']

16

In [51]:
df4

   var1  var2  var3
a    27    10    18
b    28    16    10
c    15     3     2
d     4    13    27
e    29     1    13
f    12    18    16
g    21     4    24
h     1    10    28
i    27    19    25
j     1     4    19

In [52]:
df4.loc['b','var2']

16

In [53]:
df4.iloc[1,1]

16

In [58]:
df4.loc['c':'f','var2']

c     3
d    13
e     1
f    18
Name: var2, dtype: int32

In [64]:
type(df4.loc['c':'f','var2'])

pandas.core.series.Series

In [59]:
df4['var2'][2:6]

c     3
d    13
e     1
f    18
Name: var2, dtype: int32

In [60]:
df4.var2[2:6]

c     3
d    13
e     1
f    18
Name: var2, dtype: int32

In [63]:
df4.loc['c':'f'][['var2']]

   var2
c     3
d    13
e     1
f    18

In [65]:
type(df4.loc['c':'f'][['var2']])

pandas.core.frame.DataFrame

In [70]:
df4.loc['c':'f'][['var2']]

   var2
c     3
d    13
e     1
f    18

In [66]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [67]:
df3.iloc[2]

W   -0.513680
X   -1.136574
Y    1.383130
Z   -1.391628
Name: C, dtype: float64

In [69]:
df3.iloc[[2]]

         W         X        Y         Z
C -0.51368 -1.136574  1.38313 -1.391628

In [73]:
df3.loc['B','Y']

0.985160556611458

In [74]:
df3.loc[['B'],['Y']]

          Y
B  0.985161

In [76]:
df3.loc[['A','B'],['W','X']]

          W         X
A  0.012181  0.525178
B  0.670178  0.377374

In [77]:
df3.iloc[0:2,0:2]

          W         X
A  0.012181  0.525178
B  0.670178  0.377374

In [78]:
df3.loc['A':'B','W':'X']

          W         X
A  0.012181  0.525178
B  0.670178  0.377374

In [79]:
type(df3.loc['A':'B','W':'X'])

pandas.core.frame.DataFrame

In [80]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [82]:
df3>0

       W      X      Y      Z
A   True   True  False  False
B   True   True   True  False
C  False  False   True  False
D  False   True   True  False

In [83]:
df3[df3>0]

          W         X         Y   Z
A  0.012181  0.525178       NaN NaN
B  0.670178  0.377374  0.985161 NaN
C       NaN       NaN  1.383130 NaN
D       NaN  0.247293  1.118312 NaN

In [84]:
df3[df3['W']>0]

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997

In [85]:
df3[df3['W']>0]['Y']

A   -1.609861
B    0.985161
Name: Y, dtype: float64

In [86]:
df3[df3['W']>0]['X']

A    0.525178
B    0.377374
Name: X, dtype: float64

In [87]:
type(df3[df3['W']>0]['X'])

pandas.core.series.Series

In [88]:
df3[df3['W']>0][['X']]

          X
A  0.525178
B  0.377374

In [89]:
type(df3[df3['W']>0][['X']])

pandas.core.frame.DataFrame

In [90]:
df3[df3['W']>0][['Y','X']]

          Y         X
A -1.609861  0.525178
B  0.985161  0.377374

In [91]:
df3

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [93]:
df3[(df3['W']>0) & (df3['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [94]:
df3[(df3['W']>0) | (df3['Y']>1)]

          W         X         Y         Z
A  0.012181  0.525178 -1.609861 -0.609408
B  0.670178  0.377374  0.985161 -0.385997
C -0.513680 -1.136574  1.383130 -1.391628
D -0.999693  0.247293  1.118312 -1.029796

In [95]:
df3.loc[(df3.X)>0,['X','Z']]

          X         Z
A  0.525178 -0.609408
B  0.377374 -0.385997
D  0.247293 -1.029796

In [98]:
df3

          W         X         Y         Z
A  0.014566  0.923157 -0.581335  1.887273
B  0.332154  0.486108 -0.094873  0.887350
C -1.615226 -0.749459 -1.060758  0.351828
D  0.745151 -0.266378  1.820367 -0.617766
E  0.081630  0.116968 -0.087078 -1.000059

In [99]:
df3.reset_index()

  index         W         X         Y         Z
0     A  0.014566  0.923157 -0.581335  1.887273
1     B  0.332154  0.486108 -0.094873  0.887350
2     C -1.615226 -0.749459 -1.060758  0.351828
3     D  0.745151 -0.266378  1.820367 -0.617766
4     E  0.081630  0.116968 -0.087078 -1.000059

In [100]:
df3

          W         X         Y         Z
A  0.014566  0.923157 -0.581335  1.887273
B  0.332154  0.486108 -0.094873  0.887350
C -1.615226 -0.749459 -1.060758  0.351828
D  0.745151 -0.266378  1.820367 -0.617766
E  0.081630  0.116968 -0.087078 -1.000059

In [101]:
df3.reset_index(drop=True)

          W         X         Y         Z
0  0.014566  0.923157 -0.581335  1.887273
1  0.332154  0.486108 -0.094873  0.887350
2 -1.615226 -0.749459 -1.060758  0.351828
3  0.745151 -0.266378  1.820367 -0.617766
4  0.081630  0.116968 -0.087078 -1.000059

In [102]:
df3.reset_index(drop=True,inplace=True)

In [103]:
df3

          W         X         Y         Z
0  0.014566  0.923157 -0.581335  1.887273
1  0.332154  0.486108 -0.094873  0.887350
2 -1.615226 -0.749459 -1.060758  0.351828
3  0.745151 -0.266378  1.820367 -0.617766
4  0.081630  0.116968 -0.087078 -1.000059

In [104]:
newindx = 'CA NY WY OR'.split()

In [106]:
df3['States'] = newindx

In [107]:
df3

          W         X         Y         Z States
0  0.014566  0.923157 -0.581335  1.887273     CA
1  0.332154  0.486108 -0.094873  0.887350     NY
2 -1.615226 -0.749459 -1.060758  0.351828     WY
3  0.745151 -0.266378  1.820367 -0.617766     OR
4  0.081630  0.116968 -0.087078 -1.000059     CO

In [109]:
df3.set_index('States')

               W         X         Y         Z
States
CA      0.014566  0.923157 -0.581335  1.887273
NY      0.332154  0.486108 -0.094873  0.887350
WY     -1.615226 -0.749459 -1.060758  0.351828
OR      0.745151 -0.266378  1.820367 -0.617766
CO      0.081630  0.116968 -0.087078 -1.000059

In [110]:
df3

          W         X         Y         Z States
0  0.014566  0.923157 -0.581335  1.887273     CA
1  0.332154  0.486108 -0.094873  0.887350     NY
2 -1.615226 -0.749459 -1.060758  0.351828     WY
3  0.745151 -0.266378  1.820367 -0.617766     OR
4  0.081630  0.116968 -0.087078 -1.000059     CO

In [111]:
df3.set_index('States', inplace=True)

In [112]:
df3

               W         X         Y         Z
States
CA      0.014566  0.923157 -0.581335  1.887273
NY      0.332154  0.486108 -0.094873  0.887350
WY     -1.615226 -0.749459 -1.060758  0.351828
OR      0.745151 -0.266378  1.820367 -0.617766
CO      0.081630  0.116968 -0.087078 -1.000059

In [113]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2']
inside = [1, 2, 3, 1, 2, 3]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1), ('M1', 2), ('M1', 3), ('M2', 1), ('M2', 2), ('M2', 3)]

In [114]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3)],
           )

In [118]:
df5 = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ['A', 'B'])

In [119]:
df5

             A         B
M1 1  0.669089 -1.660551
   2  0.894885 -0.075616
   3 -0.821530  0.475076
M2 1  1.120589 -0.662561
   2 -0.032585 -0.196794
   3 -1.502545 -2.104822

In [120]:
df5.loc['M1']

          A         B
1  0.669089 -1.660551
2  0.894885 -0.075616
3 -0.821530  0.475076

In [121]:
df5.loc['M1'].loc[1]

A    0.669089
B   -1.660551
Name: 1, dtype: float64

In [123]:
df5.index.names

FrozenList([None, None])

In [124]:
df5.index.names = ['Group', 'Number']

In [125]:
df5

                     A         B
Group Number
M1    1       0.669089 -1.660551
      2       0.894885 -0.075616
      3      -0.821530  0.475076
M2    1       1.120589 -0.662561
      2      -0.032585 -0.196794
      3      -1.502545 -2.104822

In [126]:
df5.xs('M1')

               A         B
Number
1       0.669089 -1.660551
2       0.894885 -0.075616
3      -0.821530  0.475076

In [127]:
df5.xs('M2')

               A         B
Number
1       1.120589 -0.662561
2      -0.032585 -0.196794
3      -1.502545 -2.104822

In [129]:
df5.xs(['M1',1])

A    0.669089
B   -1.660551
Name: (M1, 1), dtype: float64

In [130]:
df5.xs(('M1',1))

A    0.669089
B   -1.660551
Name: (M1, 1), dtype: float64

In [131]:
df5.xs(('M1',1), level=[0,1])

                     A         B
Group Number
M1    1       0.669089 -1.660551

In [132]:
df5.xs(1, level = 'Number') # M1 and M2 1 values

              A         B
Group
M1     0.669089 -1.660551
M2     1.120589 -0.662561

In [133]:
df5.xs(1,level=1)

              A         B
Group
M1     0.669089 -1.660551
M2     1.120589 -0.662561